tutorials/laminar/1DSidere/constant/ppProperties
/*--------------------------------*- C++ -*----------------------------------*	\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      ppProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ppModel          Chauchat;

// parameters for pff
alphaMax         0.45;

alphaMinFriction alphaMinFriction [ 0 0 0 0 0 0 0 ] 0.28;

Fr               Fr [ 1 -1 -2 0 0 0 0 ] 75e0;

eta0             eta0 [ 0 0 0 0 0 0 0 ] 2.748;

eta1             eta1 [ 0 0 0 0 0 0 0 ] 2.748;


packingLimiter  no;


// ************************************************************************* //
